; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_7_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 - counter
	)
  (:init
		(= (value c0) 40)
	(= (value c1) 43)
	(= (value c2) 78)
	(= (value c3) 16)
	(= (value c4) 61)
	(= (value c5) 30)
	(= (value c6) 89)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
		)
	)
)

; plan
1. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 4 of 6
2. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 4 of 6
3. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 6
4. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 4 of 6
5. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 4 of 6
6. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 4 of 6
7. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 4 of 6
8. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 4 of 6
9. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 4 of 6
10. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 4 of 6
11. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 4 of 6
12. (increment c3)
   changed: (value c3) from 16 to 23
   goals met: 4 of 6
13. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 4 of 6
14. (increment c3)
   changed: (value c3) from 23 to 31
   goals met: 4 of 6
15. (increment c3)
   changed: (value c3) from 31 to 39
   goals met: 4 of 6
16. (increment c3)
   changed: (value c3) from 39 to 47
   goals met: 4 of 6
17. (increment c3)
   changed: (value c3) from 47 to 55
   goals met: 4 of 6
18. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 4 of 6
19. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 4 of 6
20. (increment c3)
   changed: (value c3) from 55 to 65
   goals met: 3 of 6
21. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 3 of 6
22. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 3 of 6
23. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 3 of 6
24. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 3 of 6
25. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 3 of 6
26. (increment c5)
   changed: (value c5) from 30 to 35
   goals met: 3 of 6
27. (increment c5)
   changed: (value c5) from 35 to 40
   goals met: 3 of 6
28. (increment c5)
   changed: (value c5) from 40 to 45
   goals met: 3 of 6
29. (increment c5)
   changed: (value c5) from 45 to 50
   goals met: 3 of 6
30. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 3 of 6
31. (increment c5)
   changed: (value c5) from 50 to 56
   goals met: 3 of 6
32. (increment c5)
   changed: (value c5) from 56 to 62
   goals met: 4 of 6
33. (decrement c3)
   changed: (value c3) from 65 to 55
   goals met: 5 of 6
34. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 5 of 6
35. (decrement c2)
   changed: (value c2) from 78 to 73
   goals met: 5 of 6
36. (decrement c2)
   changed: (value c2) from 73 to 68
   goals met: 5 of 6
37. (increment c3)
   changed: (value c3) from 55 to 65
   goals met: 4 of 6
38. (decrement c2)
   changed: (value c2) from 68 to 63
   goals met: 5 of 6
39. (decrement c3)
   changed: (value c3) from 65 to 55
   goals met: 5 of 6
40. (decrement c2)
   changed: (value c2) from 63 to 58
   goals met: 5 of 6
41. (decrement c2)
   changed: (value c2) from 58 to 53
   goals met: 6 of 6
